{
  "backend/main.mo": "Defines core backend actor with role-based authorization, student applications, user profiles, announcements, homework, routines, class times, and lock-state management with ID counters and storage maps.",
  "feature_evidence.json": "Lists feature evidence records describing admin authorization fix and improved dashboard error handling, referencing involved frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all major frontend files including routing, pages, hooks, and UI behavior.",
  "frontend/index.css": "Defines Tailwind-based global styles using OKLCH variables for light/dark themes and applies base background/foreground styling.",
  "frontend/index.html": "Minimal HTML template mounting the React app and loading main.tsx as the entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with role-gated routes, layout wrapping for authenticated users, and error boundaries for runtime and routing failures.",
  "frontend/src/auth/AuthContext.tsx": "Implements global authentication context with session persistence, role helpers, and full query-cache reset on logout.",
  "frontend/src/auth/session.ts": "Provides localStorage-backed session utilities for saving, loading, and clearing role and username data.",
  "frontend/src/components/AppLayout.tsx": "Provides the main application layout with navigation, header, footer, and responsive sidebar, handling logout and role‑based admin access.",
  "frontend/src/components/LockIndicator.tsx": "Displays a lock or unlock icon with a tooltip indicating lock state, styled based on the `isLocked` value.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Catches runtime errors in child components and renders a fallback UI while logging error details.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Shows a styled error screen with optional error details and a button to reload or reset the error state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing and invalidating queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useLocks.ts": "Offers queries and mutations for reading and updating master, section, and item-level content lock states via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Contains query and mutation hooks for student login, applications, approvals, announcements, and other backend data interactions using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables for light and dark modes, global styles, and custom animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for managing applications, users, and lock controls with extensive query and mutation handling.",
  "frontend/src/pages/AdminLoginPage.tsx": "Simple admin login form with password validation and UI animations.",
  "frontend/src/pages/ClassRoutinePage.tsx": "Displays the latest class routine with day‑wise tables and lock status indicator.",
  "frontend/src/pages/ClassTimeSchedulePage.tsx": "Manages class time schedules with add, edit, delete dialogs and lock-aware editing controls.",
  "frontend/src/pages/HomePage.tsx": "Home page showing announcements, routines, role info, quick access, and admin overviews with lock indicators.",
  "frontend/src/pages/HomeworkPage.tsx": "Displays homework entries with add, edit, delete, and locking logic using queries and dialogs.",
  "frontend/src/pages/NoticesPage.tsx": "Manages announcements with create, update, delete, sorting, and lock-aware UI cards.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a pending-approval notice and allows the user to log out back to home.",
  "frontend/src/pages/RoleSelectPage.tsx": "Presents selectable role cards that navigate users to role-specific login or apply pages.",
  "frontend/src/pages/StudentApplyPage.tsx": "Provides a student application form, submitting data and showing a confirmation state after success.",
  "frontend/src/pages/StudentLoginPage.tsx": "Handles student login, routing based on approval status and showing errors for invalid credentials.",
  "frontend/src/pages/VisitorLoginPage.tsx": "Implements simple visitor login via a fixed password with optional password visibility toggle.",
  "frontend/src/utils/adminErrors.ts": "Provides helpers to extract readable error messages and detect authorization-related errors using common text patterns.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container queries, animations, and layout extensions.",
  "project_state.json": "Stores the project’s current state, including requirements, issues, architectural notes, and versioning metadata."
}