{
  "backend/main.mo": "Actor backend defining roles, user profiles, student applications, announcements, homework, routines, class times, locks, and admin-protected authorization helpers with in-memory Map stores.",
  "feature_evidence.json": "Feature evidence report mapping UI/UX upgrade features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s functionality across routing, auth, pages, components, and styling.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH theme tokens, light/dark variables, and base UI styling.",
  "frontend/index.html": "HTML entry point mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Main router configuration with role-based redirects, layouts, and protected routes for all pages.",
  "frontend/src/auth/AuthContext.tsx": "Auth context managing session role, username, login/logout logic, and cache clearing on logout.",
  "frontend/src/auth/session.ts": "LocalStorage-backed utilities for saving, loading, and clearing typed session data.",
  "frontend/src/components/AppLayout.tsx": "Main application layout with navigation, mobile menu, user greeting, and logout handling.",
  "frontend/src/components/auth/AuthFormField.tsx": "Reusable styled form field with label, input, validation error display, and optional icons.",
  "frontend/src/components/auth/AuthPrimaryButton.tsx": "Styled primary button for auth screens with loading state and color variants.",
  "frontend/src/components/auth/AuthScreenLayout.tsx": "Centered layout wrapper for authentication screens with decorative background elements.",
  "frontend/src/components/LockIndicator.tsx": "Displays a lock or unlock icon with a tooltip indicating lock status.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary component that catches runtime errors and renders a fallback UI.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "UI fallback shown on runtime errors with reload option and optional error details in development.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login flow, and stored identity handling via AuthClient.",
  "frontend/src/hooks/useLocks.ts": "Provides lock state queries and mutations for master, section, and item-level content locks.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for student login, applications, announcements, homework, routines, class times, and admin actions like approval and role changes.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, and animations for auth screens and decorative UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard showing applications, students, content sections, and lock controls with mutation handlers for administrative actions.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders the admin login screen using a hardcoded password and navigates to the home page on success.",
  "frontend/src/pages/ClassRoutinePage.tsx": "Displays the latest weekly class routine with a lock indicator and table layout for periods and subjects.",
  "frontend/src/pages/ClassTimeSchedulePage.tsx": "Manages class time schedules with add, edit, and delete dialogs, grouped by weekday and respecting section and item locks.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing role info, quick links, recent announcements, today's routine, and admin controls with lock status.",
  "frontend/src/pages/HomeworkPage.tsx": "Page to list, add, edit, and delete homework with section and item locking and form dialogs.",
  "frontend/src/pages/NoticesPage.tsx": "CRUD interface for announcements with section/item locks and sortable notice cards.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a pending-approval message for users awaiting admin review with option to logout.",
  "frontend/src/pages/RoleSelectPage.tsx": "Landing screen letting users choose Student, Visitor, or Admin roles for navigation.",
  "frontend/src/pages/StudentApplyPage.tsx": "Student application form handling submission, validation, login-as-pending, and success screen.",
  "frontend/src/pages/StudentLoginPage.tsx": "Student login form that authenticates via a student login mutation, handles role mapping, and navigates based on approval state.",
  "frontend/src/pages/VisitorLoginPage.tsx": "Simple visitor login page that checks a fixed password and logs the user in as a visitor.",
  "frontend/src/utils/adminErrors.ts": "Utility functions to extract readable error messages and detect authorization-related errors.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme colors, typography, container queries, and animations.",
  "project_state.json": "Project metadata describing goals, architecture notes, known issues, and implemented features for the school website app."
}