{
  "backend/main.mo": "Defines core actor logic, role types, data models, and storage maps for users, applications, announcements, homework, routines, and lock states with authorization helpers.",
  "feature_evidence.json": "Lists feature evidence items referencing frontend files, components, and tests for admin fixes, application visibility, and approval pipeline reliability.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their purposes, behaviors, and UI features.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode tokens, and base styling for backgrounds, text, borders, and UI elements.",
  "frontend/index.html": "Basic HTML entry point loading the React app from src/main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, authentication guards, error boundaries, and layout rendering based on session roles.",
  "frontend/src/auth/AuthContext.tsx": "Provides global authentication context, session persistence, login/logout logic, and cache invalidation for admin sessions.",
  "frontend/src/auth/session.ts": "Utility for saving, loading, and clearing session data in localStorage with typed roles.",
  "frontend/src/components/AppLayout.tsx": "Main layout component providing navigation, header, footer, and responsive drawer for authenticated users with admin links and logout handling.",
  "frontend/src/components/auth/AuthFormField.tsx": "Reusable styled form field with label, input, icons, validation error display, and disabled handling.",
  "frontend/src/components/auth/AuthPrimaryButton.tsx": "Gradient-styled primary auth button with loading state and variant support.",
  "frontend/src/components/auth/AuthScreenLayout.tsx": "Layout wrapper for authentication screens with decorative background and configurable max width.",
  "frontend/src/components/LockIndicator.tsx": "Displays a lock or unlock icon with a tooltip, indicating locked state of a section.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary that catches runtime errors and renders a fallback UI with reset capability.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Fallback screen shown on errors with optional error details in development and a reload button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, status tracking, and client creation.",
  "frontend/src/hooks/useLocks.ts": "Provides lock state queries and mutations for master, section, and item-level content locks using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for student login, applications, student management, announcements, homework, routines, and class times.",
  "frontend/src/index.css": "Defines Tailwind base styles, color themes, animations, and custom utility classes for the UI.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing applications, students, content sections, and lock controls with mutation handlers.",
  "frontend/src/pages/AdminLoginPage.tsx": "Simple admin login screen validating a hardcoded password and redirecting to the dashboard.",
  "frontend/src/pages/ClassRoutinePage.tsx": "Displays the latest weekly class routine with lock indicators and a table layout.",
  "frontend/src/pages/ClassTimeSchedulePage.tsx": "Allows viewing and managing class time schedules with add, edit, delete, and lock-aware controls.",
  "frontend/src/pages/HomePage.tsx": "Displays welcome header, quick-access cards, admin tools, and previews of notices and routines with lock status checks.",
  "frontend/src/pages/HomeworkPage.tsx": "Manages homework listing, creation, editing, and deletion with item and section lock enforcement.",
  "frontend/src/pages/NoticesPage.tsx": "Provides CRUD management for announcements with per-item and section-level locking.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a pending-approval message for users awaiting admin confirmation with logout navigation.",
  "frontend/src/pages/RoleSelectPage.tsx": "Presents role selection cards for student, visitor, and admin navigation.",
  "frontend/src/pages/StudentApplyPage.tsx": "Handles student application form submission and displays confirmation screen after applying.",
  "frontend/src/pages/StudentLoginPage.tsx": "Handles student login using username/password, processes backend role responses, and navigates users based on approval status.",
  "frontend/src/pages/VisitorLoginPage.tsx": "Provides a simple visitor login using a fixed password and togglable password visibility before routing to the home page.",
  "frontend/src/utils/adminErrors.ts": "Utility functions that extract human-readable error messages and detect authorization-related errors.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project’s current state, goals, issues, and existing features for the school website system."
}