{
  "backend/main.mo": "Defines authorization, user approval, role types, content models, data stores, and locking logic for notices, homework, routines, and class times.",
  "feature_evidence.json": "Feature evidence report describing the footer credit-label feature and listing modified files and components involved.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, detailing their role in routing, auth, UI, locks, and styling.",
  "frontend/index.css": "Global Tailwind/OKLCH theme variables and base styles for light/dark modes and layout foundation.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, auth guards, redirects, and wraps pages with AppLayout when authenticated.",
  "frontend/src/auth/AuthContext.tsx": "Provides global auth state, login/logout helpers, role flags, and session persistence via localStorage.",
  "frontend/src/auth/session.ts": "Utilities for saving, loading, and clearing session data in localStorage with typed roles.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with navigation, mobile drawer, user greeting, logout, and footer containing the shiny credit label.",
  "frontend/src/components/LockIndicator.tsx": "Tooltip-based lock/unlock icon component showing admin lock status for sections or items.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "A React error boundary that captures runtime errors, logs them, and displays a fallback component with a reset option.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "UI fallback shown on runtime errors, with reload/reset capability and optional error details in development.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLocks.ts": "React Query hooks for reading and updating master, section, and item content locks through the backend actor.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on applications, announcements, homework, routines, and class times via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode styles, animations, and global base styling.",
  "frontend/src/main.tsx": "Entry point that initializes React, wraps the app with QueryClientProvider and InternetIdentityProvider, and loads global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing applications, announcements, and lock controls with actions for approval, role changes, and lock toggling.",
  "frontend/src/pages/AdminLoginPage.tsx": "Renders an admin login form that validates a hardcoded password and logs in the user if correct. Handles password visibility toggle and navigation.",
  "frontend/src/pages/ClassRoutinePage.tsx": "Displays the latest class routine grouped by days, showing periods, times, subjects, and teachers. Handles loading states and section lock status.",
  "frontend/src/pages/ClassTimeSchedulePage.tsx": "Manages class time entries with add, edit, and delete dialogs, supporting per-item and section-level locking. Groups class times by weekday and sorts them by start time.",
  "frontend/src/pages/HomePage.tsx": "Shows a welcome header, quick-access sections, recent announcements, and admin-only controls. Also displays routine highlights and section lock indicators.",
  "frontend/src/pages/HomeworkPage.tsx": "Lists homework items with add, edit, and delete dialogs, respecting section and item lock states. Sorts homework by timestamp and renders editable cards.",
  "frontend/src/pages/NoticesPage.tsx": "Provides a notice board with CRUD actions for announcements and lock-aware UI. Sorts notices by timestamp and supports editing via dialog.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a pending approval message for users awaiting admin approval and provides a logout button redirecting to home.",
  "frontend/src/pages/RoleSelectPage.tsx": "Shows a role selection interface for students, visitors, and admins, each leading to its respective route.",
  "frontend/src/pages/StudentApplyPage.tsx": "Provides a student application form, submits data via mutation, and shows a confirmation screen once submitted.",
  "frontend/src/pages/StudentLoginPage.tsx": "Implements a simple student login form that authenticates locally and navigates to the home page on success.",
  "frontend/src/pages/VisitorLoginPage.tsx": "Offers a password-protected visitor login with toggled visibility and redirects to home on correct entry.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and sessionStorage parameters, including hash-based handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, including versioning, architectural notes, known issues, and a detailed list of implemented features for a role‑based school website system. Captures requirements around authentication, admin workflows, locking, SPA behavior, and deployment considerations."
}