{
  "backend/main.mo": "Defines authorization, user approval, role types, data models, and data stores for announcements, homework, routines, class times, and locking logic for sections and items.",
  "feature_evidence.json": "Lists feature evidence reports mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing their roles in routing, UI, hooks, styles, and lock-control functionality.",
  "frontend/index.css": "Sets global Tailwind CSS variables and theme styles for light and dark modes along with base styling rules.",
  "frontend/index.html": "Base HTML document that mounts the React app and loads the main TypeScript entry.",
  "frontend/src/App.tsx": "Configures the TanStack Router with guarded routes, authentication checks, and app layout handling.",
  "frontend/src/auth/AuthContext.tsx": "Provides authentication context for session role, username, login/logout functions, and admin/editor permissions.",
  "frontend/src/auth/session.ts": "Implements localStorage-backed session persistence with helpers for saving, loading, and clearing session data.",
  "frontend/src/components/AppLayout.tsx": "Main layout component providing navigation, header, footer, and responsive drawer for the app.",
  "frontend/src/components/LockIndicator.tsx": "Visual lock/unlock icon with tooltip indicating content lock state.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary class that catches runtime errors and renders a fallback UI.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Fallback screen shown on runtime errors with reload option and optional debug info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useLocks.ts": "React Query hooks for reading and updating master, section, and item-level content locks via the backend.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CRUD operations on applications, announcements, homework, routines, and related data.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light and dark theme with school-themed colors.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard that manages user applications, role changes, and lock controls while displaying announcements, homework, routines, and class times.",
  "frontend/src/pages/AdminLoginPage.tsx": "Provides an admin login form with password validation and redirects authenticated admins to the home page.",
  "frontend/src/pages/ClassRoutinePage.tsx": "Displays the latest class routine grouped by day with lock status and handles loading or empty states.",
  "frontend/src/pages/ClassTimeSchedulePage.tsx": "Allows viewing, adding, editing, and deleting class time entries with lock checks and per-item editing dialogs.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing announcements, routines, role info, quick links, and admin-only overview cards including lock status and pending approvals.",
  "frontend/src/pages/HomeworkPage.tsx": "Manages homework creation, editing, deletion, and viewing with lock controls and per-item restrictions.",
  "frontend/src/pages/NoticesPage.tsx": "Displays and manages announcements with add, edit, delete, and locking features using backend mutations and UI dialogs.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a pending-approval notice for users awaiting admin review and allows logging out.",
  "frontend/src/pages/RoleSelectPage.tsx": "Presents role selection cards (student, visitor, admin) that navigate to corresponding login or application pages.",
  "frontend/src/pages/StudentApplyPage.tsx": "Handles student application submission with form validation and displays a confirmation screen after submitting.",
  "frontend/src/pages/StudentLoginPage.tsx": "Provides a simple student login form that authenticates locally and redirects to the home page.",
  "frontend/src/pages/VisitorLoginPage.tsx": "Implements a password-gated visitor login with optional password visibility and error handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, fonts, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing goals, architecture notes, issues, and a list of implemented features for a role-based school website."
}