{
  "backend/main.mo": "Defines core actor state, user roles, approval flow, data models, storage maps, and authorization helpers for notices, homework, routines, and class time.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs for build planning.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for many frontend source files as reference metadata.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH theme variables, dark mode variants, and base element styling.",
  "frontend/index.html": "Minimal HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, route guards, query client, global providers, and layout structure with authentication gating.",
  "frontend/src/auth/AuthContext.tsx": "Provides global auth context, session load/save, admin cache invalidation, role helpers, and logout handling.",
  "frontend/src/auth/session.ts": "Implements session storage utilities for saving, loading, and clearing role and username data in localStorage.",
  "frontend/src/components/AppLayout.tsx": "Defines the main app layout with navigation, header, footer, logout handling, and embeds music and assistant widgets.",
  "frontend/src/components/assistant/assistantContent.ts": "Provides role-specific guidance content, intents, and responses for the assistant.",
  "frontend/src/components/assistant/assistantEngine.ts": "Generates assistant responses using keyword matching, context data, and role permissions.",
  "frontend/src/components/assistant/assistantStorage.ts": "Handles saving and loading assistant open state and chat history from localStorage.",
  "frontend/src/components/assistant/AssistantWidget.tsx": "Implements the floating assistant chat widget with message history, suggestions, actions, and role-aware responses.",
  "frontend/src/components/assistant/suggestions.ts": "Implements suggestion generation using token overlap and typo tolerance to propose related intents.",
  "frontend/src/components/assistant/useAssistantContextData.ts": "Aggregates announcements, homework, routines, and class times into summarized strings with loading state.",
  "frontend/src/components/auth/AuthFormField.tsx": "Reusable form field with label, input, optional icons, and error display.",
  "frontend/src/components/auth/AuthPrimaryButton.tsx": "Primary gradient button component with variants and loading state.",
  "frontend/src/components/auth/AuthScreenLayout.tsx": "Layout wrapper for auth pages with decorative background and centered content.",
  "frontend/src/components/LockIndicator.tsx": "Displays a lock/unlock icon with tooltip, indicating whether a section is locked.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary component that catches runtime errors and renders a fallback UI.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Fallback UI for runtime errors with an option to reload or reset the boundary.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated/anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout actions, and identity initialization via context.",
  "frontend/src/hooks/useLocks.ts": "React Query hooks for reading and modifying master, section, and item locks through the backend actor.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for applications, students, login, announcements, homework, routines, and class times with mutation helpers.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and custom animations and effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and InternetIdentityProvider.",
  "frontend/src/music/audioSources.ts": "Exports the static path to the background music file.",
  "frontend/src/music/BackgroundMusicPlayer.tsx": "UI controls for playing, pausing, and muting background music with error toasts.",
  "frontend/src/music/BackgroundMusicProvider.tsx": "Manages audio element, playback state, mute state, errors, and persistence of music preferences.",
  "frontend/src/music/musicPreferences.ts": "Handles loading and saving music preference state to localStorage.",
  "frontend/src/music/useBackgroundMusic.ts": "Custom hook exposing the background music context.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard displaying applications, students, content items, and lock controls with various mutations.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin password login form with UI components, validation, and navigation.",
  "frontend/src/pages/ClassRoutinePage.tsx": "Displays the latest class routine with lock status and a table for each day's schedule.",
  "frontend/src/pages/ClassTimeSchedulePage.tsx": "Displays and manages class time entries with add, edit, delete, and locking, grouping times by weekday.",
  "frontend/src/pages/HomePage.tsx": "Shows a dashboard with announcements, routines, role-based info, and admin-only sections including pending applications.",
  "frontend/src/pages/HomeworkPage.tsx": "Provides CRUD management for homework items with locking and sortable homework cards.",
  "frontend/src/pages/NoticesPage.tsx": "Handles creation, editing, deletion, and display of announcements with item-level locking.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a waiting-for-approval screen with a logout option for users pending admin approval.",
  "frontend/src/pages/RoleSelectPage.tsx": "Presents a role selection screen directing users to student, visitor, or admin entry points.",
  "frontend/src/pages/StudentApplyPage.tsx": "Implements the student application form, handles submission via mutation, shows success state, and redirects to login after applying.",
  "frontend/src/pages/StudentLoginPage.tsx": "Provides the student login UI, performs login via API, handles approved/pending/rejected states, and navigates accordingly.",
  "frontend/src/pages/VisitorLoginPage.tsx": "Renders a simple visitor login page that checks a static password and logs the user in as a visitor.",
  "frontend/src/utils/adminErrors.ts": "Utility for extracting error messages, categorizing admin-related errors, and generating user‑friendly error messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters, including hash‑based routing support and session persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, containers, shadows, and plugins used across the frontend.",
  "project_state.json": "Describes project version, architectural notes, known issues, and existing features for a role‑based school section website with SPA behavior and admin/student workflows. Captures current problems such as blank page rendering, broken authentication flows, admin dashboard errors, and malfunctioning lock controls."
}