{
  "kind": "build_request",
  "title": "Hide verbose backend/admin error details and simplify Admin Dashboard error UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-55",
      "text": "Update the Admin Dashboard error UI so it no longer shows the “Service Temporarily Unavailable” / canister-stopped message block and does not display verbose technical error details (e.g., Request ID, Reject code, IC0508, HTTP details) to end users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove this tipe of all error i dont need chack of admin in it"
        ]
      },
      "acceptanceCriteria": [
        "When `getAllApplications()` or `getStudentsList()` fails, the Admin Dashboard does not show the long technical dump to the user.",
        "The Admin Dashboard renders a short, generic English error message (e.g., “Could not load data. Please try again.”) and a Retry button.",
        "Underlying error objects/details are still logged to the browser console for debugging."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Remove Admin Dashboard user-facing error messaging that explicitly mentions admin authorization checks (e.g., titles like “Access Denied” and messages like “You need to be logged in as Admin to view this data”). Replace with neutral English error text that does not reference admin-check logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i dont need chack of admin in it"
        ]
      },
      "acceptanceCriteria": [
        "If an authorization failure happens, the Admin Dashboard does not display “Access Denied” or similar admin-check text.",
        "The Admin Dashboard shows neutral English text (e.g., “Could not load data. Please log in again and retry.”) plus a Retry button.",
        "Authorization protection is not removed from backend calls; only the UI messaging is changed."
      ]
    },
    {
      "id": "REQ-57",
      "text": "Gate admin-only data fetching on admin-only UI surfaces so non-admin users do not trigger admin-only backend queries (e.g., do not run `useGetAllApplications()` on the Home page unless the current session role is Admin).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i dont need chack of admin in it"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as Student or Visitor, the Home page does not call `getAllApplications()` and does not produce admin-only query errors in the console.",
        "When logged in as Admin, the Home page still loads pending application counts and shows the admin-only cards as before."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (immutable shadcn components).",
    "Do not modify frontend/src/main.tsx (immutable path).",
    "Keep backend authorization and access control intact; only change frontend error presentation and when queries run."
  ],
  "nonGoals": [
    "Do not fix or restart a stopped backend canister (this is an environment/deployment issue).",
    "Do not remove backend role checks for admin-only methods like `getAllApplications()` and `getStudentsList()`."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}