{
  "kind": "build_request",
  "title": "Polish and modernize the login UI across roles",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Upgrade the visual design of all login-related screens to look more premium and “cool” while keeping the existing school-friendly blue/white base theme: Role selection, Visitor login, Admin login, Student login, and Student apply pages. Improvements should include a more polished background (e.g., subtle gradient + soft decorative shapes), improved card styling (depth, borders, glow), and smoother micro-animations for initial load and hover/focus states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "can you j\\est make login ui more cool"
        ]
      },
      "acceptanceCriteria": [
        "The following pages have noticeably improved styling and motion without changing their core functionality: frontend/src/pages/RoleSelectPage.tsx, VisitorLoginPage.tsx, AdminLoginPage.tsx, StudentLoginPage.tsx, StudentApplyPage.tsx.",
        "All pages remain mobile-responsive and look good at common breakpoints (mobile, tablet, desktop).",
        "No user-facing text is changed to non-English; existing copy remains simple English.",
        "Animations respect reduced-motion preferences (no distracting looping motion when prefers-reduced-motion is enabled)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Make form inputs and buttons on login/apply pages feel more modern and interactive: consistent spacing, stronger focus rings, clearer error states, optional leading icons where appropriate, and improved button hover/pressed/loading states (including disabled appearance).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make login ui more cool"
        ]
      },
      "acceptanceCriteria": [
        "Inputs show a clear focus state (ring/border) consistent with the existing Tailwind theme variables.",
        "Error states are visually distinct (border + helper text), and remain accessible (sufficient contrast).",
        "Buttons have consistent hover/active/disabled styling across Visitor/Admin/Student login and Student apply pages.",
        "Existing loading behavior remains correct (e.g., Student login shows spinner when pending; submit buttons disable during pending mutations)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Improve the Role Selection page presentation to feel more premium: refine card layout/typography, enhance the role icon tiles, and add subtle motion/hover effects that feel cohesive with the login pages (without adding new navigation steps or changing the current routes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make login ui more cool"
        ]
      },
      "acceptanceCriteria": [
        "Role cards have enhanced visual hierarchy (title/description balance, spacing) and a cohesive premium style matching the updated login screens.",
        "Hover/focus states for role cards are smooth and clear, and do not cause layout shift.",
        "Clicking each role still navigates to the same existing paths (/student-apply, /visitor-login, /admin-login) with SPA behavior."
      ]
    }
  ],
  "constraints": [
    "Do not modify any immutable frontend paths listed in SYSTEM_CONTEXT (e.g., frontend/src/main.tsx and frontend/src/hooks/useActor.ts).",
    "Do not change backend logic, authentication rules, passwords, or routing behavior; this request is UI/UX polish only.",
    "Keep user-facing text in English."
  ],
  "nonGoals": [
    "Adding new authentication methods or changing how login works (Internet Identity, tokens, sessions, passwords).",
    "Changing admin/visitor/student password values or introducing password reset flows.",
    "Backend changes, schema changes, or new canister methods."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}