{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify Admin Dashboard error UI and gate admin-only queries",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Simplify Admin Dashboard load-failure UI to hide verbose technical details while still logging full errors to console.",
      "acceptanceCriteria": [
        "When `getAllApplications()` or `getStudentsList()` fails, the Admin Dashboard does not show the long technical dump to the user.",
        "The Admin Dashboard renders a short, generic English error message (e.g., “Could not load data. Please try again.”) and a Retry button.",
        "Underlying error objects/details are still logged to the browser console for debugging."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Admin Dashboard error rendering to remove the canister-stopped/technical-dump block and stop displaying raw error strings (Request ID / reject code / IC0508 / HTTP details). Show a short generic message + Retry button, while keeping full error objects logged via console.error for debugging."
        },
        {
          "path": "frontend/src/utils/adminErrors.ts",
          "operation": "modify",
          "description": "Add a small helper for user-facing (sanitized) error text selection so the UI can display generic messages while preserving getErrorMessage() for console/debug usage. This supports hiding verbose technical details from end users."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update user-facing mutation failure toasts within the Admin Dashboard (approve/reject/promote/demote/lock toggles) to avoid showing verbose technical error strings to end users; keep detailed error logging in the console for debugging."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Replace Admin Dashboard authorization-related error wording with neutral, non-admin-check messaging.",
      "acceptanceCriteria": [
        "If an authorization failure happens, the Admin Dashboard does not display “Access Denied” or similar admin-check text.",
        "The Admin Dashboard shows neutral English text (e.g., “Could not load data. Please log in again and retry.”) plus a Retry button.",
        "Authorization protection is not removed from backend calls; only the UI messaging is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Remove user-facing titles/messages like “Access Denied” / “You need to be logged in as Admin...” from the Admin Dashboard error UI. Use neutral English messaging and keep a Retry action. (Backend authorization remains unchanged.)"
        },
        {
          "path": "frontend/src/utils/adminErrors.ts",
          "operation": "modify",
          "description": "Ensure the error categorization and/or new public-message helper can map authorization failures to neutral retry guidance (e.g., log in again), without exposing admin-check logic in user-facing strings."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Prevent non-admin sessions from triggering admin-only data fetching on non-admin UI surfaces (e.g., Home page).",
      "acceptanceCriteria": [
        "When logged in as Student or Visitor, the Home page does not call `getAllApplications()` and does not produce admin-only query errors in the console.",
        "When logged in as Admin, the Home page still loads pending application counts and shows the admin-only cards as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useGetAllApplications() hook to accept an optional configuration (e.g., an enabled override) so calling pages can gate admin-only queries without changing backend authorization. This will be driven by the authorization-based session role on the frontend (verify the authorization component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Gate the admin-only applications query on the Home page using the current session role (isAdmin). Ensure getAllApplications() is not queried for Student/Visitor sessions, while keeping the existing admin-only cards and pending count behavior for Admin sessions (verify the authorization component's usage instructions before implementing)."
        }
      ]
    }
  ]
}